tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"

brew "bash"
brew "bat"
brew "chafa"
brew "cmake"
brew "curl"
brew "direnv"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gnupg"
brew "libyaml"
brew "lsd"
brew "neovim"
brew "openssl"
brew "pinentry-mac"
brew "pipx"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "walk"
brew "wget"
brew "zsh"

cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "mullvadvpn"
cask "obsidian"
cask "rectangle"
cask "tailscale"

cask "font-jetbrains-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-iosevka-nerd-font"

