# taps
tap 'buo/cask-upgrade'
tap 'homebrew/bundle'
tap 'hashicorp/tap'

# common tools
brew 'bash'
brew 'bat'
brew 'curl'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gpg'
brew 'lsd'
brew 'pinentry-mac'
brew 'ripgrep'
brew 'starship'
brew 'uv'
brew 'vim'
brew 'wget'
brew 'yt-dlp'
brew 'zellij'
brew 'zsh'

# development tools
brew 'awscli'
brew 'git'
brew 'jq'
brew 'mise'
brew 'pre-commit'
brew 'yq'

# gui applications
cask 'google-chrome'
cask 'iterm2'
cask 'notion'
cask 'orbstack'
cask 'rectangle'
cask 'vlc'

# ides
cask 'visual-studio-code'

# fonts
cask 'font-cascadia-code-nf'
cask 'font-monaspace-nerd-font'
cask 'font-jetbrains-mono-nerd-font'

# vi: filetype=ruby
